package com.justeryt.discordbot.commands.Utils;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Random;

public class RandomWords {

    private static final List<String> insults = new ArrayList<>(Arrays.asList(
            "Идиот", "Дебил", "Мудак", "Лох", "Тупица", "Дурак", "Глупец", "Хам", "Свинья", "Козел",
            "Болван", "Придурок", "Урод", "Тролль", "Недоразумение", "Неудачник", "Тормоз", "Пустозвон",
            "Тупоголовый", "Простак", "Дубина", "Кретин", "Капуста", "Троглодит", "Бездарь", "Безмозглый",
            "Бестолочь", "Быдло", "Дятел", "Болван", "Дурачок", "Лентяй", "Недотепа", "Кретин", "Дебил",
            "Идиот", "Тупица", "Мудак", "Тролль", "Придурок", "Шут", "Полудурок", "Глупец", "Дурень",
            "Задрот", "Бездарь", "Полоумный", "Танк", "Киберспортсмен", "Рейтар", "Нуб", "Профан",
            "Школьник", "Фидер", "Рандом", "Ламер", "Афкер", "Дилетант", "Дотер", "Танчик",
            "Марадёр", "Хам", "Десантник", "Шкурник", "Рикошетер", "Фармер", "Раздолбай",
            "Поттер", "Танкист", "Бронебойщик", "Артиллерист", "Разведчик", "Снайпер",
            "Махровый", "Щитоносец", "Танчег", "Контратакующий", "Боец"
    ));
    private static final List<String> adjectives = new ArrayList<>(Arrays.asList(
            "Тупой", "Глупый", "Несносный", "Раздражающий", "Невыносимый", "Скучный", "Отвратительный",
            "Неприятный", "Дурной", "Надоедливый", "Нелепый", "Невежливый", "Безобразный", "Арогантный",
            "Злой", "Подлый", "Дерзкий", "Самонадеянный", "Самовлюбленный", "Суетливый", "Хамоватый",
            "Раздолбайский", "Несговорчивый", "Неприятный", "Занудный", "Невыразительный", "Дешевый",
            "Раздражительный", "Независимый", "Неуклюжий", "Мрачный", "Отстойный", "Уродливый",
            "Смазливый", "Никчемный", "Даунский", "Упоротый", "Сопливый", "Тупой", "Жалкий", "Завистливый",
            "Безнадежный", "Хитрый", "Бестолковый", "Тряпичный", "Безмозглый", "Задумчивый", "Шаткий", "Крамольный",
            "Вздорный", "Злой", "Скудный", "Презренный", "Наглый", "Безразличный", "Несчастный", "Ошеломленный",
            "Мелочный", "Некомпетентный", "Нелепый", "Придурковатый", "Отсталый", "Суетливый", "Мерзкий", "Задумчивый",
            "Глупый", "Неумный", "Злобный", "Грубый", "Проказливый", "Бесполезный", "Непутевый", "Ленивый",
            "Жадный", "Недалекий", "Самонадеянный", "Брезгливый", "Малодушный", "Тупоголовый", "Вредный", "Гнусный",
            "Простоватый", "Несносный", "Слабый"
    ));

    public static String generateInsult() {
        Random random = new Random();
        String adjective = adjectives.get(random.nextInt(adjectives.size()));
        String insult = insults.get(random.nextInt(insults.size()));
        return adjective + " " + insult;
    }

}
